app/wsdl.xml

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:tns="tns" xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:soap12env="http://www.w3.org/2003/05/soap-envelope/" xmlns:senc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:senv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap12enc="http://www.w3.org/2003/05/soap-encoding/" targetNamespace="tns" name="SomeSoapService"><wsdl:types><xs:schema targetNamespace="tns" elementFormDefault="qualified"><xs:complexType name="stringArray"><xs:sequence><xs:element name="string" type="xs:string" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="echo"><xs:sequence><xs:element name="str" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="cnt" type="xs:integer" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="echoResponse"><xs:sequence><xs:element name="echoResult" type="tns:stringArray" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="stringArray" type="tns:stringArray"/><xs:element name="echo" type="tns:echo"/><xs:element name="echoResponse" type="tns:echoResponse"/></xs:schema></wsdl:types><wsdl:message name="echo"><wsdl:part name="echo" element="tns:echo"/></wsdl:message><wsdl:message name="echoResponse"><wsdl:part name="echoResponse" element="tns:echoResponse"/></wsdl:message><wsdl:service name="SomeSoapService"><wsdl:port name="SomeSoapService" binding="tns:SomeSoapService"><soap:address location="http://localhost:5000/soap/someservice"/></wsdl:port></wsdl:service><wsdl:portType name="SomeSoapService"><wsdl:operation name="echo" parameterOrder="echo"><wsdl:input name="echo" message="tns:echo"/><wsdl:output name="echoResponse" message="tns:echoResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="SomeSoapService" type="tns:SomeSoapService"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="echo"><soap:operation soapAction="echo" style="document"/><wsdl:input name="echo"><soap:body use="literal"/></wsdl:input><wsdl:output name="echoResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding></wsdl:definitions>
