tests/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="tns" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <ns0:Body>
      <ns1:echo>
         <ns1:str>hello world</ns1:str>
         <ns1:cnt>3</ns1:cnt>
      </ns1:echo>
   </ns0:Body>
</SOAP-ENV:Envelope>
